app/controllers/auth_controller.rb

  def index
    if request.post?
      user = User.find_all_by_password_and_login(params[:password],params[:login])
---
SELECT * FROM `users` WHERE (`users`.`password` = '1234' AND `users`.`login` = 'dima')