app/controllers/home_controller.rb

SELECT * FROM `pictures` ORDER BY rating
SELECT * FROM `categories` ORDER BY name DESC
SELECT * FROM `users` WHERE (`users`.`id` = 4004)
---
  def index
    @most_popular_pics = Picture.find_most_popular
    @new_pics = Picture.find_new
    @categories = Category.find_all_categories
    id = session[:user_id]
    if id
      @user = User.find(id)

SELECT * FROM `categories` WHERE (`categories`.`id` = 3)
SELECT * FROM `categories` ORDER BY name DESC
---
  def show_category
    @category = Category.find(params[:id])
    @pictures = @category.pictures
    @categories = Category.find_all_categories

SELECT * FROM `pictures` WHERE (`pictures`.`id` = 1)
UPDATE `pictures` SET `show_count` = 1, `updated_at` = '2011-04-08 09:54:02' WHERE `id` = 1
SELECT * FROM `categories` ORDER BY name
---
  def show_picture
    @picture = Picture.find(params[:id])
    @tags = @picture.tags
    show_count = @picture.show_count + 1
    @picture.update_attribute("show_count", show_count)
    @categories = Category.find_all_categories

SELECT * FROM `pictures` WHERE (`pictures`.`id` = 6)
UPDATE `pictures` SET `rating_count` = 1, `updated_at` = '2011-04-08 15:10:22' WHERE `id` = 6
---
  def add_rating
    @picture = Picture.find(params[:id])
    r = params[:r].to_i()
    count = @picture.rating_count + 1
    new_rating_d = (@picture.rating * @picture.rating_count + r) / count

    new_rating_d = (new_rating_d * 100).to_i.to_f / 100

    @picture.update_attribute("rating", new_rating_d)

SELECT * FROM `tags` WHERE (name = 'Porsche')
SELECT * FROM `categories` ORDER BY name
---
  def search
    #@name = params[:name]
    @search_info = SearchInfo.new
    @search_info.search_str=("Porsche 911")
    @search_info.width=(100)
    @search_info.height=(100)

    @strs = @search_info.search_str.split(",")

    @tags = Tag.find_by_name("Смешные картинки")
    @pictures = Picture.find_by_tags(@tags)

    @categories = Category.find_all_categories

SELECT * FROM `categories` ORDER BY name
---
  def advanced_search
    @categories = Category.find_all_categories