app/controllers/home_controller.rb

  def show_category
    @category = Category.find(params[:id])

    @pictures = Picture.find_by_category_id(params[:id])
---
SELECT * FROM `pictures` WHERE (category_id = '3') ORDER BY rating DESC