app/controllers/pictures_controller.rb

  def index
    @pictures = Picture.all
---
SELECT * FROM `pictures`

  def edit
    @picture = Picture.find(params[:id])
---
SELECT * FROM `pictures` WHERE (`pictures`.`id` = 13)