app/controllers/users_controller.rb

INSERT INTO `users` (`login`, `password`, `email`, `created_at`, `updated_at`) VALUES('gugugu', 'pass', 'gu@gugu', '2011-04-07 14:49:05', '2011-04-07 14:49:05')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save